package dev.chililisoup.bigsignwriter.font.supplier;

import dev.chililisoup.bigsignwriter.font.FontFile;

import java.util.Map;

import static java.util.Map.entry;

@SuppressWarnings("UnnecessaryUnicodeEscape")
public class EndermiteFont implements FontSupplier {
    @Override
    public FontFile get() {
        return new FontFile("Endermite", "Opticality", 3, Map.<Character, String[]>ofEntries(
                entry(' ', new String[]{
                        "   ",
                        "   ",
                        "   "
                }),
                entry('A', new String[]{
                        "𜺠𜴧𜴧𜺠",
                        "𜷴▂▂𜷴",
                        "𜷴  𜷴"
                }),
                entry('B', new String[]{
                        "𜺠𜴧𜴧𜺠",
                        "𜷴▂𜺠𜴒",
                        "𜷴▂▂𜷴"
                }),
                entry('C', new String[]{
                        "𜺠𜴧𜴧𜺠",
                        "𜷴   ",
                        "𜴍▂▂𜴉"
                }),
                entry('D', new String[]{
                        "🯥𜴧𜴧𜺠",
                        "𜷴  𜷴",
                        "𜷴▂▂𜴍"
                }),
                entry('E', new String[]{
                        "🯥𜴧𜴧▖",
                        "𜷴▂𜺠 ",
                        "𜷴▂▂𜺠"
                }),
                entry('F', new String[]{
                        "🯥𜴧𜴧▖",
                        "𜷴▂𜺠 ",
                        "𜷴   "
                }),
                entry('G', new String[]{
                        "𜺠𜴧𜴧𜺠",
                        "𜷴  ▂",
                        "𜴍▂▂𜴍"
                }),
                entry('H', new String[]{
                        "🯥  ▖",
                        "𜷴▂▂𜷴",
                        "𜷴  𜷴"
                }),
                entry('I', new String[]{
                        "𜴧▖𜴧",
                        " 𜷴 ",
                        "▂𜷴▂"
                }),
                entry('J', new String[]{
                        "   ▖",
                        "   𜷴",
                        "𜴍▂▂𜴍"
                }),
                entry('K', new String[]{
                        "▖  ▖",
                        "𜷴▂𜺠𜴒",
                        "𜷴  𜷴"
                }),
                entry('L', new String[]{
                        "▖  ",
                        "𜷴  ",
                        "𜷴▂▂"
                }),
                entry('M', new String[]{
                        "🯥  ▖",
                        "𜷴𜴄𜴁𜷴",
                        "𜷴  𜷴"
                }),
                entry('N', new String[]{
                        "𜶻  ▖",
                        "𜷴𜺨🯦𜺠\u073C𜷴",
                        "𜷴  𜶘"
                }),
                entry('O', new String[]{
                        "𜺠𜴧𜴧𜺠",
                        "𜷴  𜷴",
                        "𜴍▂▂𜴍"
                }),
                entry('P', new String[]{
                        "🯥𜴧𜴧𜺠",
                        "𜷴▂𜺠𜴒",
                        "𜷴   "
                }),
                entry('Q', new String[]{
                        "𜺠𜴧𜴧𜺠",
                        "𜷴  𜷴",
                        "𜴍▂\u073C\u073C𜴉𜴺"
                }),
                entry('R', new String[]{
                        "🯥𜴧𜴧𜺠",
                        "𜷴▂𜺠𜴒",
                        "𜷴  𜷴"
                }),
                entry('S', new String[]{
                        "𜺠𜴉𜴧𜴉𜺠",
                        "𜴍▂▂ ",
                        "𜴉𜺠▂𜺠𜴍"
                }),
                entry('T', new String[]{
                        "𜴧▖𜴧",
                        " 𜷴 ",
                        " 𜷴 "
                }),
                entry('U', new String[]{
                        "▖  ▖",
                        "𜷴  𜷴",
                        "𜴍▂▂𜴍"
                }),
                entry('V', new String[]{
                        "\uD836\uDE9D▖  ▖\uD836\uDE9D",
                        "\uD836\uDE9D𜷴  𜷴\uD836\uDE9D",
                        " 𜴍𜺠𜴍 "
                }),
                entry('W', new String[]{
                        "▖  ▖",
                        "𜷴  𜷴",
                        "𜴍𜺠𜴍𜺠𜴍"
                }),
                entry('X', new String[]{
                        "\uD836\uDE9D▖  ▖\uD836\uDE9D",
                        " 𜴺𜴉𜴺 ",
                        "\u073C𜷴  𜷴\u073C"
                }),
                entry('Y', new String[]{
                        "\uD836\uDE9D▖  ▖\uD836\uDE9D",
                        " 🯤🯥🯤 ",
                        " \u073C\u073C𜷴\u073C\u073C "
                }),
                entry('Z', new String[]{
                        "🯥𜴧𜴧▖",
                        " 𜺠𜴐𜺨",
                        "𜵈𜶬▂🯥"
                }),
                entry('`', new String[]{
                        "𜺠\u073C ",
                        " 𜺨\uD836\uDE9D",
                        "  "
                }),
                entry('1', new String[]{
                        "\u073C\u073C𜺠▖ ",
                        " 𜷴 ",
                        " 𜷴 "
                }),
                entry('2', new String[]{
                        "𜺠𜴉𜴧𜴉𜺠",
                        " ▂𜺠𜴒",
                        "𜴍𜺠▂𜺠𜺠"
                }),
                entry('3', new String[]{
                        "𜺠𜴉𜴧𜴉𜺠",
                        " ▂𜺠𜴒",
                        "𜴉𜺠𜺠𜺠𜴒"
                }),
                entry('4', new String[]{
                        "🯥  ▖",
                        "𜷴▂▂𜷴",
                        "   𜷴"
                }),
                entry('5', new String[]{
                        "🯥𜴉𜴧𜴉▖",
                        "𜷴▂▂ ",
                        "𜴉𜺠▂𜺠𜴍"
                }),
                entry('6', new String[]{
                        "𜺠𜴉𜴧𜴉𜺠",
                        "𜷴▂▂ ",
                        "𜴍𜺠▂𜺠𜴍"
                }),
                entry('7', new String[]{
                        "🯥𜴧𜴧▖",
                        " 𜺠𜴐𜺨",
                        " 𜷴  "
                }),
                entry('8', new String[]{
                        "𜺠𜴧𜴧𜺠",
                        "𜴍▂▂𜴍",
                        "𜴍▂▂𜴍"
                }),
                entry('9', new String[]{
                        "𜺠𜴧𜴧𜺠",
                        "𜴍▂▂𜷴",
                        "   𜷴"
                }),
                entry('0', new String[]{
                        "𜺠𜴧𜴧𜺠",
                        "𜷴𜵑𜴁𜷴",
                        "𜴍▂▂𜴍"
                }),
                entry('-', new String[]{
                        "   ",
                        "▂▂▂",
                        "   "
                }),
                entry('=', new String[]{
                        "   ",
                        "▂▂▂",
                        "𜴧𜴧𜴧"
                }),
                entry('[', new String[]{
                        "     ",
                        " ▖ ▖ ",
                        "\uD836\uDE9D𜴉▖▖▖▖𜴉\uD836\uDE9D"
                }),
                entry(']', new String[]{
                        "    ",
                        " ▖ ▖ ",
                        "𜴉𜺠𜺠𜺠𜺠𜴉"
                }),
                entry(',', new String[]{
                        " ",
                        " ",
                        "🯥\u073C"
                }),
                entry('.', new String[]{
                        " ",
                        " ",
                        "𜺠\u073C"
                }),
                entry('/', new String[]{
                        "   ▖",
                        " \u073C▖🯤 ",
                        "▖🯤  "
                }),
                entry('\\', new String[]{
                        "▖   ",
                        " 🯤▖\u073C ",
                        "  🯤▖"
                }),
                entry(';', new String[]{
                        " ",
                        "𜴉\u073C",
                        "🯥\u073C"
                }),
                entry('\'', new String[]{
                        "🯥\u073C",
                        " ",
                        " "
                }),
                entry('~', new String[]{
                        "𜺠𜴉𜴉𜺠𜺠𜴉",
                        "    ",
                        "    "
                }),
                entry('!', new String[]{
                        " ▖ ",
                        " 𜷴 ",
                        " ▖ "
                }),
                entry('@', new String[]{
                        "𜺠𜴧𜴧𜺠",
                        "𜷴 ▖𜺠𜷴",
                        "𜴍▂▂𜺨"
                }),
                entry('#', new String[]{
                        " ▖ ▖ ",
                        "\uD836\uDE9D𜺨𜷴🮂𜷴𜺨\uD836\uDE9D",
                        "\uD836\uDE9D𜺨𜷴🮂𜷴𜺨\uD836\uDE9D"
                }),
                entry('$', new String[]{
                        "\u073C\u073C\u073C𜺠▖𜺠\u073C\u073C\u073C",
                        "𜴍𜺠𜷴𜺠𜺨",
                        "𜴀𜴉𜷴𜴉🯤"
                }),
                entry('%', new String[]{
                        "▖  ▖",
                        " \u073C\u073C▖🯤\uD836\uDE9D\uD836\uDE9D",
                        "▖🯤\uD836\uDE9D ▖"
                }),
                entry('^', new String[]{
                        " 𜺠𜺠 𜺠𜺠 ",
                        "𜷴  𜺨  𜷴",
                        " 𜺨𜴜𜺠𜴐𜺨 "
                }),
                entry('&', new String[]{
                        "𜺠𜴉𜴉𜴉𜺠",
                        "𜴍𜺠𜺠𜺠𜴍",
                        "𜴍𜺠𜴺𜴉𜴺"
                }),
                entry('*', new String[]{
                        "𜺠\u073C\u073C\u073C𜺠",
                        "𜴀𜺨𜴀",
                        "  "
                }),
                entry('(', new String[]{
                        "𜺠𜴧",
                        "𜷴 ",
                        "𜴍▂"
                }),
                entry(')', new String[]{
                        "𜴧𜺠",
                        " 𜷴",
                        "▂𜴍"
                }),
                entry('_', new String[]{
                        "   ",
                        "   ",
                        "▂▂▂"
                }),
                entry('+', new String[]{
                        "  𜺠  ",
                        "▂▂𜷴▂▂",
                        "  𜷴  "
                }),
                entry('{', new String[]{
                        "𜺠𜴧 𜴧𜺠",
                        "  ▖  ",
                        "\uD836\uDE9D𜴉▖▖▖▖𜴉\uD836\uDE9D"
                }),
                entry('}', new String[]{
                        " ▖ ▖ ",
                        "  ▖  ",
                        "𜶀𜺠𜺠𜺠𜵑"
                }),
                entry('<', new String[]{
                        "𜺠𜴧 𜴧𜺠",
                        " \uD836\uDE9D▖ ▖\uD836\uDE9D ",
                        "𜺠𜴉𜴉𜴉𜴉𜴉𜺠"
                }),
                entry('>', new String[]{
                        "     ",
                        "𜺠𜴧 𜴧𜺠",
                        "\u073C𜺠𜴉𜴉𜴉𜴉𜺠\u073C"
                }),
                entry('?', new String[]{
                        "𜺠𜴧𜴧𜺠",
                        "  𜺠𜴒",
                        " ▖  "
                }),
                entry('|', new String[]{
                        "▖",
                        "𜷴",
                        "𜷴"
                }),
                entry(':', new String[]{
                        " ",
                        "𜴉\u073C",
                        "𜴉\u073C"
                }),
                entry('"', new String[]{
                        "🯥 🯥",
                        "  ",
                        "  "
                })
        ));
    }
}
