//? if >= 1.21.4 {
package dev.chililisoup.bigsignwriter.font.supplier;

import dev.chililisoup.bigsignwriter.font.FontFile;

import static java.util.Map.entry;

@SuppressWarnings("UnnecessaryUnicodeEscape")
public final class PlainsFont {
    public static FontFile get() {
        return new FontFile("Plains", "chililisoup")
                .height(3)
                .characters(
                        entry(' ', new String[]{
                                "    ",
                                "    ",
                                "    "
                        }),
                        entry('A', new String[]{
                                "𜷥▀𜷤",
                                "▌▀▌",
                                "▌  ▌"
                        }),
                        entry('B', new String[]{
                                "▌▀𜷤",
                                "▌▀▙",
                                "▌▄𜵰"
                        }),
                        entry('C', new String[]{
                                "𜷥▀𜴴",
                                "▌   ",
                                "𜶫▄𜵭"
                        }),
                        entry('D', new String[]{
                                "▌▀𜷤",
                                "▌  ▌",
                                "▌▄𜵰"
                        }),
                        entry('E', new String[]{
                                "▌▀🮅",
                                "▌▀ ",
                                "▌▄▆"
                        }),
                        entry('F', new String[]{
                                "▌▀🮅",
                                "▌▀ ",
                                "▌   "
                        }),
                        entry('G', new String[]{
                                "𜷥▀𜴴",
                                "▌ 𜴳𜷞",
                                "𜶫▖▖🯦𜶫"
                        }),
                        entry('H', new String[]{
                                "▌  ▌",
                                "▌▀▌",
                                "▌  ▌"
                        }),
                        entry('I', new String[]{
                                "🮅╹╹▌🮅",
                                "  ▌ ",
                                "▆╻╻▌▆"
                        }),
                        entry('J', new String[]{
                                "  🮅▌",
                                "   ▌",
                                "𜶫▄𜵰"
                        }),
                        entry('K', new String[]{
                                "▌ ,▖𜵰",
                                "▌🯦𜷴𜴶 ",
                                "▌ '▘𜷤"
                        }),
                        entry('L', new String[]{
                                "▌   ",
                                "▌   ",
                                "▌▄▆"
                        }),
                        entry('M', new String[]{
                                "𜷤, ,𜷥",
                                "▌▘𜷴▘▌",
                                "▌  ▌"
                        }),
                        entry('N', new String[]{
                                "𜷤,\u073C\u073C ▌",
                                "▌▘𜷴▖▌",
                                "▌ \u193A'𜶫"
                        }),
                        entry('O', new String[]{
                                "𜷥▀𜷤",
                                "▌  ▌",
                                "𜶫▄𜵰"
                        }),
                        entry('P', new String[]{
                                "▌▀𜷤",
                                "▌▀𜴂",
                                "▌   "
                        }),
                        entry('Q', new String[]{
                                "𜷥▀𜷤",
                                "▌ 𜶻▌",
                                "𜶫▖▖𜴍𜶩"
                        }),
                        entry('R', new String[]{
                                "▌▀𜷤",
                                "▌𜴍𜷴𜴺𜴂",
                                "▌ '▘𜷤"
                        }),
                        entry('S', new String[]{
                                "𜷥▀𜴴",
                                "𜴅𜴍🯦𜵈𜶻",
                                "𜶨▄𜵰"
                        }),
                        entry('T', new String[]{
                                "🮅╹╹▌🮅",
                                "  ▌ ",
                                "  ▌ "
                        }),
                        entry('U', new String[]{
                                "▌  ▌",
                                "▌  ▌",
                                "𜶫▄𜵰"
                        }),
                        entry('V', new String[]{
                                "▌  ▌",
                                "╹𜷴╻, ▌",
                                " '𜴦𜷥▘"
                        }),
                        entry('W', new String[]{
                                "▌  ▌",
                                "▌𜺣▖𜺣▌",
                                "𜵰▘𜺨▘𜶫"
                        }),
                        entry('X', new String[]{
                                "𜶫, ,▌",
                                "𜷋𜷴🯦𜷴𜴂",
                                "▌' '𜷤"
                        }),
                        entry('Y', new String[]{
                                "╹𜷴╻, ▌",
                                " '𜴦𜷥▘",
                                "  𜷥╵ "
                        }),
                        entry('Z', new String[]{
                                "🮅▘▘𜷴▛",
                                " ▖𜷴▘ ",
                                "▟𜷴▖▖▆"
                        }),
                        entry('a', new String[]{
                                "    ",
                                "𜷥▘▘🯦▌",
                                "𜶫▄▌"
                        }),
                        entry('b', new String[]{
                                "▌   ",
                                "▌🯦▘▘𜷤",
                                "▌▄𜵰"
                        }),
                        entry('c', new String[]{
                                "    ",
                                "𜷥▀𜴴",
                                "𜶫▄𜵭"
                        }),
                        entry('d', new String[]{
                                "   ▌",
                                "𜷥▘▘🯦▌",
                                "𜶫▄▌"
                        }),
                        entry('e', new String[]{
                                "    ",
                                "𜷥𜴺𜴺𜴺𜷤",
                                "𜶫▄𜵭"
                        }),
                        entry('f', new String[]{
                                " 𜷥𜺧𜺧𜴴",
                                "𜴳▌𜴳 ",
                                " ▌  "
                        }),
                        entry('g', new String[]{
                                "    ",
                                "𜶪𜴺𜴺𜴺𜷥",
                                "𜶨▄𜵰"
                        }),
                        entry('h', new String[]{
                                "▌   ",
                                "▌🯦▘▘𜷤",
                                "▌  ▌"
                        }),
                        entry('i', new String[]{
                                "  𜴳 ",
                                " ╹╹▌ ",
                                "▆╻╻▌▆"
                        }),
                        entry('j', new String[]{
                                "   𜴳",
                                "  🮅▌",
                                "𜶫▄𜵰"
                        }),
                        entry('k', new String[]{
                                "▌   ",
                                "▌▖𜵈▘ ",
                                "▌ '▘𜷞"
                        }),
                        entry('l', new String[]{
                                "🮅▌  ",
                                " ▌  ",
                                " 𜶫▄"
                        }),
                        entry('m', new String[]{
                                "    ",
                                "▌𜵈𜺣𜵈𜷤",
                                "▌𜺨𜴍𜺨▌"
                        }),
                        entry('n', new String[]{
                                "    ",
                                "▌🯦▘▘𜷤",
                                "▌  ▌"
                        }),
                        entry('o', new String[]{
                                "    ",
                                "𜷥▀𜷤",
                                "𜶫▄𜵰"
                        }),
                        entry('p', new String[]{
                                "    ",
                                "𜷤𜴺𜴺𜴺𜵮",
                                "▌   "
                        }),
                        entry('q', new String[]{
                                "    ",
                                "𜶪𜴺𜴺𜴺𜷥",
                                "   ▌"
                        }),
                        entry('r', new String[]{
                                "    ",
                                "▌🯦▘▘𜴴",
                                "▌   "
                        }),
                        entry('s', new String[]{
                                "    ",
                                "𜶪𜴺𜴺𜴺𜴇",
                                "𜶨▄𜵮"
                        }),
                        entry('t', new String[]{
                                "🮅▌  ",
                                "𜴳▌𜴳 ",
                                " 𜶫▄"
                        }),
                        entry('u', new String[]{
                                "    ",
                                "▌  ▌",
                                "𜶫▄▌"
                        }),
                        entry('v', new String[]{
                                "    ",
                                "╹𜷴╻ ╻𜷴╹",
                                " ▘𜴍▘ "
                        }),
                        entry('w', new String[]{
                                "    ",
                                "▌𜺣𜵈𜺣▌",
                                "𜶫𜴍𜺨𜴍▌"
                        }),
                        entry('x', new String[]{
                                "    ",
                                "𜴦▖𜺣▖𜴗",
                                "𜷡▘𜺨▘𜷞"
                        }),
                        entry('y', new String[]{
                                "    ",
                                "𜶫▖𜺣𜺣▌",
                                "𜶨▄𜵰"
                        }),
                        entry('z', new String[]{
                                "    ",
                                "🮅▘𜴺𜷴𜴗",
                                "𜷡𜷴𜵅▖▆"
                        }),
                        entry('`', new String[]{
                                " 𜴦𜷞 ",
                                "    ",
                                "    "
                        }),
                        entry('1', new String[]{
                                "𜵈𜴍▘▌ ",
                                "  ▌ ",
                                "▆╻╻▌▆"
                        }),
                        entry('2', new String[]{
                                "𜴵▀𜷤",
                                "𜷋𜵈🯦𜴍𜴂",
                                "▌▄▆"
                        }),
                        entry('3', new String[]{
                                "𜴵▀𜷤",
                                " 🯦🯦🯦𜷂",
                                "𜶨▄𜵰"
                        }),
                        entry('4', new String[]{
                                "▌  ▌",
                                "𜴦🯦🯦🯦▌",
                                "   ▌"
                        }),
                        entry('5', new String[]{
                                "▌▀🮅",
                                "🮅🯦▘▘𜷤",
                                "𜶨▄𜵰"
                        }),
                        entry('6', new String[]{
                                "𜷥▀𜴴",
                                "▌🯦▘▘𜷤",
                                "𜶫▄𜵰"
                        }),
                        entry('7', new String[]{
                                "🮅▘▘𜷴▛",
                                " ▖𜷴▘ ",
                                "▟▘'  "
                        }),
                        entry('8', new String[]{
                                "𜷥▀𜷤",
                                "▟▀▙",
                                "𜶫▄𜵰"
                        }),
                        entry('9', new String[]{
                                "𜷥▀𜷤",
                                "𜶫▖▖🯦▌",
                                "𜶨▄𜵰"
                        }),
                        entry('0', new String[]{
                                "𜷥▀𜷤",
                                "▌▖🯦▘▌",
                                "𜶫▄𜵰"
                        }),
                        entry('-', new String[]{
                                "    ",
                                "🯦𜴳🯦𜴳🯦",
                                "    "
                        }),
                        entry('=', new String[]{
                                "    ",
                                "◚▀◚",
                                "◚▀◚"
                        }),
                        entry('[', new String[]{
                                "▌▀🮅",
                                "▌   ",
                                "▌▄▆"
                        }),
                        entry(']', new String[]{
                                "🮅▀▌",
                                "   ▌",
                                "▆▄▌"
                        }),
                        entry(',', new String[]{
                                "    ",
                                "    ",
                                " ▌  "
                        }),
                        entry('.', new String[]{
                                "    ",
                                "    ",
                                " 𜴳  "
                        }),
                        entry('/', new String[]{
                                "  ,▖▛",
                                " ▖𜷴▘ ",
                                "▟▘'  "
                        }),
                        entry('\\', new String[]{
                                "▜▖,  ",
                                " ▘𜷴▖ ",
                                "  '▘▙"
                        }),
                        entry(';', new String[]{
                                "    ",
                                " ◚  ",
                                " ▌  "
                        }),
                        entry('\'', new String[]{
                                " ▌  ",
                                "    ",
                                "    "
                        }),
                        entry('~', new String[]{
                                "    ",
                                "𜵯▘🯦▖𜵯",
                                "    "
                        }),
                        entry('!', new String[]{
                                " ▌  ",
                                " ▌  ",
                                " 𜴳  "
                        }),
                        entry('@', new String[]{
                                "𜷥▀𜷤",
                                "𜷴 𜶪╻𜵰",
                                "𜶫▄𜵭"
                        }),
                        entry('#', new String[]{
                                " 𜷴│ ",
                                "◚𜷴▘𜷴◚",
                                "◚𜷴▘𜷴◚"
                        }),
                        entry('$', new String[]{
                                "𜷡🯦𜷴🯦𜷞",
                                "𜴅𜴍𜷴𜵈𜶻",
                                "𜴦🯦𜷴🯦𜴗"
                        }),
                        entry('%', new String[]{
                                "🯦𜶮🯦▖▛",
                                " ▖𜷴▘ ",
                                "▟▘🯦𜶮🯦"
                        }),
                        entry('^', new String[]{
                                "𜷋𜵈𜴍𜵈𜶻",
                                "🮂  🮂",
                                "    "
                        }),
                        entry('&', new String[]{
                                "𜷥▘𜷴𜵈 ",
                                "𜶶𜴍𜷴𜺣𜵯",
                                "𜶫▖▖𜴍𜶩"
                        }),
                        entry('*', new String[]{
                                "𜴣▖𜷴▖𜴔",
                                "𜴯▘𜷴▘𜴫",
                                "    "
                        }),
                        entry('(', new String[]{
                                "𜷋𜵯▀",
                                "▌   ",
                                "𜴅𜶩▄"
                        }),
                        entry(')', new String[]{
                                "▀𜶩𜶻",
                                "   ▌",
                                "▄𜵯𜴂"
                        }),
                        entry('_', new String[]{
                                "    ",
                                "    ",
                                "◛▄◛"
                        }),
                        entry('+', new String[]{
                                " \u073C\u073C▂\u073C\u073C ",
                                "◛╻▌╻◛",
                                " \u193A🮅\u193A "
                        }),
                        entry('{', new String[]{
                                " ▖🯦🯦🮅",
                                "𜶪𜶮  ",
                                " ▘🯦🯦▆"
                        }),
                        entry('}', new String[]{
                                "🮅🯦🯦▖ ",
                                "  𜶮𜵮",
                                "▆🯦🯦▘ "
                        }),
                        entry('<', new String[]{
                                " 𜷋𜵯╹'",
                                "𜶪𜷂  ",
                                " 𜴅𜶩╻,"
                        }),
                        entry('>', new String[]{
                                "'╹𜶩𜶻 ",
                                "  𜷖𜵮",
                                ",╻𜵯𜴂 "
                        }),
                        entry('?', new String[]{
                                "𜴵▀𜷤",
                                " 𜺣▖𜴍𜴂",
                                " 𜴳  "
                        }),
                        entry('|', new String[]{
                                " ▌  ",
                                " ▌  ",
                                " ▌  "
                        }),
                        entry(':', new String[]{
                                "    ",
                                " ◚  ",
                                " ◚  "
                        }),
                        entry('"', new String[]{
                                " ▌▌ ",
                                "    ",
                                "    "
                        })
                );
    }
}
//?}